COLLEGE_SITE = "https://www.kre.dp.ua/"

API_URL = "https://pytba.readthedocs.io/en/latest/index.html"

BOT_TOKEN = ""

TRELLO_CONFIG = {
    "Boards": {
        "DFKR_Info": "",
    },
    "Lists": {
        "News": "",
        "Admins": "",
        "Admission": "",
        "Feedbacks": "",
        "AdmissionRequests": "",
        "NewsSubscribers": "",
        "Registrations": '',
    },
    "Labels": {
        "Feedback_Type_bot": "",
        "Feedback_Type_college": "",
        "Feedback_Type_admission": "",

        "Admission_Active": "",

        "Request_Waiting": "",
        "Request_Conversation": "",
        "Request_Closed": "",

        "Register_OpenDoors": "",
        "Register_Courses": ""
    }
}
TRELLO_KEY = ""
TRELLO_TOKEN = ""

MESSAGES = {
    # "first": "Бачу, ви вперше тут. Розповім вам про Дніпровський фаховий коледж радіоелектроніки.",
    "start": f'Привіт! Я чат-бот Приймальної комісії Дніпровського фахового коледжу радіоелектроніки, помічник для абітурієнтів та їх батьків.\n\nЗа деякими питаннями ви можете звернутись до <a href="{COLLEGE_SITE}">сайту коледжу</a>.',
    "pk_landing_sites": f"Про день відкритих дверей: <a href='https://landing.kre.dp.ua/'>посилання</a>\nСайт приймальної комісії: <a href='https://pk.kre.dp.ua/'>посилання</a>",
    "admission_info": f"Нагадуємо, що  офіційним зверненням до приймальної комісії та засобом підтримання зв'язку з нею є особиста явка до її консультаційного центру або надсилання електронного листа на поштову скриньку приймальної комісії\n\n<b>Поштова скринька приймальної комісії:</b> pk@kre.dp.ua",

    "location": '<b>🚎 Тролейбусами</b> <code>"А"</code> або <code>"Б"</code>, №<code>4</code> до зупинки "Облвійськомат"\n\n<b>🚃 Трамваями</b> №<code>5</code>, <code>12</code>, <code>17</code> до зупинки "вул. Степана Бандери", "Облвійськомат"\n\n<b>🚌 Автобусами</b> №<code>32</code>, <code>32К</code>, <code>33</code>, <code>40</code>, <code>73</code>, <code>87А</code>, <code>109</code>, <code>155</code> до зупинки "вул. Степана Бандери", "Облвійськомат"',

    "spec_171": '<b>Галузь знань:</b>\n<code>Електроніка, автоматизація  та електронні комунікації</code>\n\n<b>Спеціальність за нац. класифікацією:</b>\n<code>171 Електроніка</code>\n\n<b>Назва спеціальності за міжнародною стандартною класифікацією освіти:</b>\n<code>0714 Electronics and automation</code>\n\nСучасні прилади та електронна техніка пройшли неймовірно цікавий та складний шлях розвитку від механічного етапу через лампову еру до сьогоденних витончених рішень, таких як портативні плеєри, роботи та роботизовані вузли, чіповані станки, 3D принтери, розумні побутові прилади з десятками варіантів виконання своїх дій та інші. Модерні прилади більше не займають собою цілі цехи чи кімнати, вони наповнені високотехнічним функціоналом, виконують широкі спектри задач та завдань не потребуючи при цьому особистої атомної електростанції для своєї роботи. Але такі можливості грунтуються на певному наборі цікавих витончених та складних технологій, освоєння яких і пропонується при навчанні за даною освітньою програмою.\n\nВипускником є спеціаліст, що здатен спроектувати та виготовити будь-який сучасний мікроелектронний прилад чи відремонтувати вже існуючий прилад будь-якої ери виробництва. Також за даною освітньою програмою навчають основам програмування.\n\n<a href="https://telegra.ph/Specіalnіst-171-Elektronіka-05-19">Source URL</a>',
    "spec_172": '<b>Галузь знань:</b>\n<code>Електроніка, автоматизація  та електронні комунікації</code>\n\n<b>Спеціальність за нац. класифікацією:</b>\n<code>172 Електронні комунікації та радіотехніка</code>\n\n<b>Назва спеціальності за міжнародною стандартною класифікацією освіти:</b>\n<code>0714 Electronics and automation</code>\n\nСучасний світ наповнений системами передачі даних та зв’язку. Радіозв’язок та телебачення за останньої декади ступили на новий щабель свого існування - військові, поліцейські, рятівники, безліч служб та підприємств потребують швидких, точних, надійних та безпечних систем зв’язку. Це означає, що не тільки конкретна рація, нагрудна/нашоломна камера, пристрій сигналізації та оповіщення, чи мобільний телефон потребують своєчасного ремонту, обслуговування, модернізації, а ще й відповідні центри зв’язку, що їх сполучають та координують і можуть бути розташовані як в приміщенні так і в пересувній формі.  Злагоджена та адекватна робота такої системи потребує відповідного компетентного спеціаліста.\n\nВажко також переоцінити вплив систем сучасного розвинутого телебачення та їх всюдисутність. В такі системи входять як засоби трансляції медіа-контенту високої якості за смаками користувача (серіали, програми, фільми і т.п.), так і новин державного рівня, що не потребує подальших пояснень. Одним словом, суспільство, що не розвиває і не підтримує функціонування власних систем передачі інформації, зв’язку та оповіщення, буде оповіщеним через чужі.\n\nВипускником за даною освітньою програмою є компетентний спеціаліст з технічного обслуговування, ремонту та монтажу будь-яких з вищезгаданих та подібних їм типів обладнання та систем. Також за даною освітньою програмою навчають основам програмування.\n\nДля того, щоб сформувати сучасну високошвидкісну систему передачі даних,яка послужить кінцевому замовнику в тому чи іншому виді, її, перш за все, необхідно наповнити необхідної кількістю приладів. Замовлення чи імпорт таких може не відповідати технічним вимогам в частині їх функціоналу чи  бюджету, тому, всупереч популярним стереотипам, багато приладів та вузлів для сучасних надшвидкісних систем зв’язку виготовляють з нуля (from scratch), щоб одразу задовольнити всі вимоги до них та, за можливості, зменшити чи анулювати будь-які негативні впливи, наслідки чи подолати обтяжливість функціоналу ще на моменті проектування.\n\nСпеціаліст, що буде випущений за даною освітньою програмою, отримує необхідну базу знань для долучення до економічної діяльності в якості проектувальника та архітектора зі створення приладів і вузлів для сучасних надшвидких систем зв’язку та їх подальшої можливої підтримки, супроводження, модернізації. Також за даною освітньою програмою навчають основам програмування.\n\n<a href="https://telegra.ph/Specіalnіst-172-Elektronnі-komunіkacіi-ta-radіotehnіka-05-19">Source URL</a>',
    "spec_123": '<b>Галузь знань:</b>\n<code>Інформаційні технології</code>\n\n<b>Спеціальність за нац. класифікацією:</b>\n<code>123 Комп’ютерна інженерія</code>\n\n<b>Назва спеціальності за міжнародною стандартною класифікацією освіти:</b>\n<code>0612 Database and network design and administration</code>\n<code>0714 Electronics and automation</code>\n\nНескінченні офісні простори, дата центри, фірми, контори, приватні будівлі - все заповнено сьогодні комп’ютерними системами. Сучасна ера вимагає  не просто окремих користувачів з власними персональними комп’ютерами, а поєднання  тисяч і мільйонів комп’ютерів в окремі системи і мережі.  Цілі економіки світу стають  цифровими, бізнес та сфера послуг впроваджує свою роботу онлайн, більшість видів оплачуваних активностей стають щільно пов’язаними з обробкою, аналізом та обчисленням великої кількості даних.\n\nПравильна робота таких систем та їх обмін інформацією через мережі потребує їх адекватного, точного проектування та обслуговування, так як всі ці системи та мережі сьогодні використовують неймовірно велику кількість програмного забезпечення та складних апаратних вузлів.\n\nВипускник за даною освітньою програмою отримає навички як з проектування, створення, розгортання, обслуговування та ремонту комп’ютерних систем і мереж, так і з програмування  - для вміння розробляти та підлагоджувати програмне забезпечення під будь-які потреби.\n\n<a href="https://telegra.ph/Specіalnost-123-Kompyuterna-іnzhenerіya-05-19">Source URL</a>',

    "stud_rada": f'<b>Місія <a href="https://kre.dp.ua/wp-content/uploads/2023/11/DSC06208-scaled.jpg">студентської ради</a> – зробити студентське життя незабутнім та сповненим яскравих вражень!</b>'
}

FEEDBACK_VARIANTS = [
    ["bot", "Проблема із ботом"],
    ["college", "Відгук про коледж"],
    ["admission", "Про приймальну комісію"]
]

REQUESTS_EMOJIS = {
    "65fadbcc5d918563e8900520": "🕐 Очікується",
    "65fadbe5a9bc6cbf4b0f4d5e": "✅ Спілкування",
    "65fadbf6af69add182f2caf6": "🚫 Закрито",
}

SEND_LAST_NEWS = 3
OPEN_DOORS_DAYS_DATES = [
    ["30.03.2024", "10:00", False], 
    ["13.04.2024", "10:00", True], 
    ["27.04.2024", "10:00", True], 
    ["11.05.2024", "10:00", True], 
    ["25.05.2024", "10:00", True]
]
ACTUAL_OPEN_DOORS_DAY = 2

DEVELOPER_USER_ID = 0
